"ok" = "Ok";
"identifyReason" = "Identificación";
"done" = "Hecho";
"code" = "Código";

// ERRORS
"alertTitleError" = "ERROR";
"alertMessage000" = "Ha ocurrido un error";
"alertMessage001" = "La clave digital debe ser alfanumérico, contener una mayúscula una minúscula y un número teniendo entre 8 y 24 caracteres de longitud.";

// PSD2 ERROR
"PSD2ErrorDataTitle" = "Los datos insertados no son correctos";
"PSD2ErrorDataMessage1" = "Ocurrio un error. Le quedan ";
"PSD2ErrorDataMessage2" = " intentos";

// BIOMETRIC ALERT
"titleBiometricAccessAlert" = "Acceso biométrico";
"messageBiometricAccessAlert" = "¿Quieres usar tu huella o Face ID para operar?";
"okButtonBiometricAccess" = "SÍ, USAR";
"koButtonBiometricAccess"  = "NO, GRACIAS";

// PENDING PURCHASE
"titlePendingPurchase" = "Introduce el código que te acabamos de enviar";
"acceptButtonPendingPurchase" = "ACEPTAR";
"rejectButtonPendingPurchase" = "CANCELAR";

// INSERT DIGITAL KEY
"hintDigitalKey" = "Clave digital";
"titleDigitalKey" = "Clave digital";
"subTitleDigitalKey" = "Necesitamos que introduzcas tu clave digital";
"acceptButtonDigitalKey" = "ACEPTAR";

// PSD2 VALIDATE
"titleIntroValidate" = "Acción requerida";
"subtitleIntroValidate" = "Para cumplir con la Directiva de Servicios de Pago 2 (PSD2), cuyo objetivo es mejorar la seguridad, debemos solicitar su clave digital cada 90 días para mostrarle información relativa a su tarjeta.";
"acceptButtonIntroValidate" = "INGRESAR CLAVE";

"titleOtpViewValidate" = "Código";
"subtitleOtpViewValidate" = "Antes de introducir tu clave digital necesitamos que introduzcas el código que te acabamos de enviar";
"resendButtonOtpViewValidate" = "Reenviar";
"acceptButtonOtpViewValidate" = "ACEPTAR";

"forgotKeyButtonDigitalKeyViewValidate" = "He olvidado mi clave digital";

// Enum Form
"btn_accept" = "ACEPTAR";
"btn_create_key" = "CREAR CLAVE";
"btn_next" = "SIGUIENTE";
"btn_resend" = "Reenviar SMS";
"btn_enter_key" = "INGRESAR CLAVE";
"msg_cancel_process" = "Operación cancelada";
"msg_failure" = "No ha sido posible realizar la operación";
"msg_error" = "ERROR";
"msg_otp_resend" = "Se ha reenviado el código";
"msg_otp_wrong" = "El código no es correcto";
"msg_remaining" = "Ocurrio un error.\nTe quedan @% intentos";
"msg_sms_resend" = "Se ha reenviado el SMS con el código";
"msg_success" = "Operación realizada con éxito";
"msg_server_error" = "Se ha detectado un error inesperado en nuestros servidores, por favor intentarlo de nuevo más tarde.";
"msg_try" = "Vuelve a intentarlo o contacta con nuestro servicio de atención al cliente";
"msg_warning" = "Aviso";
"fill_pwd_repeat" = "Debe definir la clave digital y repetirlo";
"fill_digital_key" = "Debe escribir la clave digital";
"fill_digital_key_invalid" = "Clave digital inválida";
"fill_digital_key_equals" = "Las claves digitales deben coincidir";
"fill_digital_key_repeat" = "Debe definir la clave digital y repetirla";

// PSD2 CREATE
"psd2_code_subtitle" = "Introduce el código que te acabamos de enviar";
"psd2_digital_key_setup" = "Para acabar de configurar tu cuenta necesitamos que crees tu clave digital.";
"psd2_mandatory_sca" = "La Directiva de Servicios de Pago 2 (PSD2) tiene como objetivo mejorar la seguridad y reducir el fraude a través de la Autenticación Reforzada de Clientes (SCA).\nLa clave digital es obligatoria para operaciones con tarjeta y banca móvil.";
"psd2_digital_key_about" = "Sobre la clave digital";
"psd2_digital_key_create" = "Tu clave digital te será solicitada en las operaciones con tarjeta y en algunas operaciones de la app.\n\nSi no recuerda tu clave digital puedes crearla de nuevo aquí.";
"psd2_code_receive" = "Introduce el código que te\nacabamos de enviar";
"psd2_code_new" = "Introduce tu nueva clave\ndigital";
"psd2_code_repeat" = "Repite tu nueva clave digital";
"psd2_digital_key_new" = "Nueva clave digital";
"psd2_digital_key_change_failure" = "Tu clave digital no ha sido modificada correctamente";
"psd2_digital_key_change_success" = "Clave digital cambiada con éxito";
"psd2_mandatory" = "Para cumplir con la Directiva de Servicios de Pago 2 (PSD2,\ncuyo objetivo es mejorar la seguridad,\ndebemos solicitar tu clave digital cada 90 días para poder mostrarte información relativa a tu tarjeta.";
"psd2_mandatory_personal" = "La clave digital es personal y nunca le será requerido a través de cualquier canal (SMS, eMail u otros,\nni desde nuestro servicio de atención al cliente.\nÚnicamente le será requerido cuando opere con su tarjeta y para consultar sus movimientos en la aplicación.";
"psd2_phone" = "Ahora introduce tu número de teléfono móvil";
"psd2_phone_check" = "Para verificar su identidad, por favor, introduzca su móvil";
"psd2_phone_number" = "Número de teléfono";

// PSD2 MODIFY
"psd2_required" = "Acción requerida";
"psd2_digital_key_generate" = "La clave digital le será requerido en operaciones con tarjeta y en algunas operaciones de su banca electrónica. \n\nSi no recuerda su número secreto puede generar uno nuevo aquí.";
"psd2_code_insert" = "Insertar código";
"psd2_insert_code" = "Antes de introducir tu clave digital necesitamos que introduzcas el código que te acabamos de enviar";
"psd2_digital_key_ok" = "Su clave digital se ha creado correctamente";
"psd2_digital_key" = "Clave digital";
"psd2_digital_key_repeat" = "Repetir clave digital";
"psd2_pwd_restrictions" = "Debe tener entre 8 y 24 caracteres, una mayúscula, una minúscula y un número";
"psd2_secret_code_match" = "Los códigos secretos deben coincidir";
"psd2_secret_code_wrong" = "Los datos insertados no son correctos";

// PSD2 Modify Phone
"msg_change_phone" = "Actualizar móvil";
"msg_cp_success" = "Móvil actualizado con éxito";
"msg_cp_success_s" = "Hemos guardado tu nuevo número de móvil, a partir de ahora recibirás los avisos en este número";
"title_change_phone" = "¿Cuál es tu nuevo número de móvil?";
"title_change_phone_s" = "Es importante que esté actualizado para que puedas operar con normalidad";


